docs/test/results/20260321/k6-knee/id-generator-vus250.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 250 max VUs, 45s max duration (incl. graceful stop):
              * default: 250 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 250/250 VUs, 236 complete and 0 interrupted iterations
default   [   6% ] 250 VUs  01.0s/15s

running (02.0s), 250/250 VUs, 543 complete and 0 interrupted iterations
default   [  13% ] 250 VUs  02.0s/15s

running (03.0s), 250/250 VUs, 845 complete and 0 interrupted iterations
default   [  20% ] 250 VUs  03.0s/15s

running (04.0s), 250/250 VUs, 1219 complete and 0 interrupted iterations
default   [  26% ] 250 VUs  04.0s/15s

running (05.0s), 250/250 VUs, 1563 complete and 0 interrupted iterations
default   [  33% ] 250 VUs  05.0s/15s

running (06.0s), 250/250 VUs, 1908 complete and 0 interrupted iterations
default   [  40% ] 250 VUs  06.0s/15s

running (07.0s), 250/250 VUs, 2238 complete and 0 interrupted iterations
default   [  46% ] 250 VUs  07.0s/15s

running (08.0s), 250/250 VUs, 2608 complete and 0 interrupted iterations
default   [  53% ] 250 VUs  08.0s/15s

running (09.0s), 250/250 VUs, 2968 complete and 0 interrupted iterations
default   [  60% ] 250 VUs  09.0s/15s

running (10.0s), 250/250 VUs, 3343 complete and 0 interrupted iterations
default   [  66% ] 250 VUs  10.0s/15s

running (11.0s), 250/250 VUs, 3709 complete and 0 interrupted iterations
default   [  73% ] 250 VUs  11.0s/15s

running (12.8s), 250/250 VUs, 4009 complete and 0 interrupted iterations
default   [  80% ] 250 VUs  12.0s/15s

running (15.2s), 250/250 VUs, 4388 complete and 0 interrupted iterations
default   [  86% ] 250 VUs  13.0s/15s

running (16.2s), 250/250 VUs, 4745 complete and 0 interrupted iterations
default   [  93% ] 250 VUs  14.0s/15s

running (17.2s), 250/250 VUs, 5111 complete and 0 interrupted iterations
default   [ 100% ] 250 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5380    301.254158/s
    checks_succeeded...: 100.00% 5380 out of 5380
    checks_failed......: 0.00%   0 out of 5380

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=811.24ms min=61.82ms med=664.71ms max=3.67s p(90)=1.25s p(95)=1.7s  p(99)=2.24s
      { expected_response:true }...: avg=811.24ms min=61.82ms med=664.71ms max=3.67s p(90)=1.25s p(95)=1.7s  p(99)=2.24s
    http_req_failed................: 0.00%  0 out of 5380
    http_reqs......................: 5380   301.254158/s

    EXECUTION
    iteration_duration.............: avg=710.15ms min=61.94ms med=664.19ms max=1.98s p(90)=1.07s p(95)=1.15s p(99)=1.39s
    iterations.....................: 5380   301.254158/s
    vus............................: 250    min=250       max=250
    vus_max........................: 250    min=250       max=250

    NETWORK
    data_received..................: 1.2 MB 69 kB/s
    data_sent......................: 479 kB 27 kB/s



running (17.9s), 000/250 VUs, 5380 complete and 0 interrupted iterations
default ✓ [ 100% ] 250 VUs  15s