docs/test/results/20260321/k6-knee/id-generator-vus400.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 400 max VUs, 45s max duration (incl. graceful stop):
              * default: 400 looping VUs for 15s (gracefulStop: 30s)


running (00.9s), 400/400 VUs, 210 complete and 0 interrupted iterations
default   [   6% ] 400 VUs  00.9s/15s

running (01.9s), 400/400 VUs, 433 complete and 0 interrupted iterations
default   [  13% ] 400 VUs  01.9s/15s

running (02.9s), 400/400 VUs, 796 complete and 0 interrupted iterations
default   [  20% ] 400 VUs  02.9s/15s

running (03.9s), 400/400 VUs, 1209 complete and 0 interrupted iterations
default   [  26% ] 400 VUs  03.9s/15s

running (04.9s), 400/400 VUs, 1569 complete and 0 interrupted iterations
default   [  33% ] 400 VUs  04.9s/15s

running (05.9s), 400/400 VUs, 1903 complete and 0 interrupted iterations
default   [  40% ] 400 VUs  05.9s/15s

running (06.9s), 400/400 VUs, 2235 complete and 0 interrupted iterations
default   [  46% ] 400 VUs  06.9s/15s

running (09.7s), 400/400 VUs, 2596 complete and 0 interrupted iterations
default   [  53% ] 400 VUs  07.9s/15s

running (10.7s), 400/400 VUs, 3000 complete and 0 interrupted iterations
default   [  60% ] 400 VUs  08.9s/15s

running (11.7s), 400/400 VUs, 3399 complete and 0 interrupted iterations
default   [  66% ] 400 VUs  09.9s/15s

running (12.7s), 400/400 VUs, 3769 complete and 0 interrupted iterations
default   [  73% ] 400 VUs  10.9s/15s

running (13.7s), 400/400 VUs, 3964 complete and 0 interrupted iterations
default   [  80% ] 400 VUs  11.9s/15s

running (14.7s), 400/400 VUs, 4293 complete and 0 interrupted iterations
default   [  86% ] 400 VUs  12.9s/15s

running (15.7s), 400/400 VUs, 4710 complete and 0 interrupted iterations
default   [  93% ] 400 VUs  13.9s/15s

running (16.7s), 400/400 VUs, 5115 complete and 0 interrupted iterations
default   [ 100% ] 400 VUs  14.9s/15s

running (17.7s), 000/400 VUs, 5538 complete and 0 interrupted iterations
default ✓ [ 100% ] 400 VUs  15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5538    313.307948/s
    checks_succeeded...: 100.00% 5538 out of 5538
    checks_failed......: 0.00%   0 out of 5538

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=1.23s min=114.61ms med=1.1s  max=3.26s p(90)=1.86s p(95)=2.19s p(99)=3.09s
      { expected_response:true }...: avg=1.23s min=114.61ms med=1.1s  max=3.26s p(90)=1.86s p(95)=2.19s p(99)=3.09s
    http_req_failed................: 0.00%  0 out of 5538
    http_reqs......................: 5538   313.307948/s

    EXECUTION
    iteration_duration.............: avg=1.11s min=114.83ms med=1.05s max=2.21s p(90)=1.49s p(95)=1.68s p(99)=2.02s
    iterations.....................: 5538   313.307948/s
    vus............................: 400    min=400       max=400
    vus_max........................: 400    min=400       max=400

    NETWORK
    data_received..................: 1.3 MB 72 kB/s
    data_sent......................: 493 kB 28 kB/s



running (17.7s), 000/400 VUs, 5538 complete and 0 interrupted iterations
default ✓ [ 100% ] 400 VUs  15s